buildings = `Петропавловская крепость СПб - Трезини 
Ботный дом в Петропавловской крепости в СПб - Вист 
Петропавловский собор СПб – Трезини 
Петровские ворота Петропавловской крепости в СПб - Трезини 
Интерьер и иконостас Петропавловского собора СПб - Зарудный 
Здание 12 коллегий в СПб - Трезини 
Летний дворец Петра в СПб - Трезини 
Дворец Монплезир в Петергофе - Леблон и Микетти 
Дворец Меншикова в СПб – Фонтана, Шедель 
Дворец Меншикова в Ораниенбауме – Фонтана, Шедель и др. 
Константиновский дворец в Стрельне - Микетти 
Кунсткамера в СПб – Маттарнови 
Церковь Иоанна Воина в Москве – Зарудный 
Церковь Михаила Архангела («Меншикова башня») в Москве – Зарудный 
Петропавловская церковь в Москве – Зарудный 
Петропавловская церковь в Ярославле 
Церковь в Подмоклово, Московская область 
Церковь в Каймарах, Татарстан 
Церковь в Державино, Татарстан 
Ледяной дом на Неве 
Большой дворец в Петергофе – Растрелли 
Екатерининский дворец в Царском селе – Растрелли 
Парадная лестница в Екатерининском дворце Царском селе – Растрелли 
Большой зал в Екатерининском дворце Царском селе – Растрелли 
Картинный зал в Екатерининском дворце Царском селе – Растрелли 
Янтарная комната в Екатерининском дворце Царском селе – Растрелли 
Зимний дворец в СПб - Растрелли 
Иорданская лестница Зимнего дворца – Растрелли 
Большая церковь Зимнего дворца - Растрелли 
Часы «Павлин» в Зимнем дворце – Кокс, Кулибин 
Смольный монастырь и собор в СПб - Растрелли 
Андреевская церковь в Киеве – Растрелли 
Мариинский дворец в Киеве – Растрелли 
Строгановский дворец в СПб - Растрелли 
Никольский морской собор в СПб - Чевакинский 
Колокольня Троице-Сергиевой Лавры – Ухтомский 
Красные ворота в Москве – Ухтомский 
Арка «Новая Голландия» в СПб - Валлен-Деламот 
Большой Гостиный двор в СПб - Растрелли 
Большой Гостиный двор в СПб - Валлен-Деламот 
Академия художеств в СПб - Валлен-Деламот 
Катальная горка в Ораниенбауме – Ринальди 
Большой Эрмитаж в СПб - Фельтен 
Чесменская церковь в СПб – Фельтен 
Чесменский дворец в СПб - Фельтен 
Решетка летнего сада и Верхне-Лебяжий мост в СПб – Фельтен 
Театр Олимпико в Виченце – Палладио 
Вилла Ротонда близ Виченцы - Палладио 
Эрмитажный театр в СПб – Кваренги 
Ассигнационный банк в СПб – Кваренги 
Академия наук в СПб – Кваренги 
Странноприимный дом в Москве - Кваренги 
Конногвардейский манеж в СПб – Кваренги 
Александровский дворец в Царском селе – Кваренги 
Смольный институт благородных девиц - Кваренги  
Камеронова галерея в Царском селе  - Камерон 
Большой дворец в Павловске – Камерон 
Храм Дружбы в Павловске – Камерон 
Колоннада Аполлона в Павловске – Камерон 
Павильон Трех Граций в Павловске - Камерон 
Мост Кентавров в Павловске - Бренна 
Невские ворота Петропавловской крепости в СПб - Львов 
Церковь «Кулич и пасха» в СПб - Львов 
Приоратский замок в Гатчине – Львов 
Борисоглебский монастырь и собор в Торжке – Львов 
Таврический дворец в СПб – Старов 
Троицкий собор Александро-Невской лавры в СПб – Старов 
Казанский собор в Казани – Старов 
Дом Пашкова в Москве – Баженов  
Дворцовый комплекс Царицыно в Москве – Баженов 
Фигурный мост в Царицыно в Москве – Баженов 
Фигурные ворота в Царицыно в Москве – Баженов 
Макет большого кремлевского дворца – Баженов 
Петровский путевой дворец в Москве - Казаков 
Голицынская больница в Москве – Казаков 
Церковь Космы и Дамиана в Москве – Казаков 
Церковь Филиппа Митрополита в Москве – Казаков 
Колонный зал благородного собрания (Дома Союзов) в Москве – Казаков 
Большой театр в Москве - Бове 
Манеж в Москве – Бове 
Усадьба Архангельское под Москвой – Бове 
Грот в Александровском саду в Москве – Бове 
Всехскорбященская церковь в Москве - Бове 
Музыкальный  павильон конного двора в Кузьминках в Москве – Жилярди 
Дом князя Гагарина в Москве – Жилярди 
Здание опекунского совета в Москве - Жилярди 
Михайловский замок – Бренна 
Большой дворец в Гатчине – Бренна 
Адмиралтейство в СПб – Захаров 
Андреевский собор в Кронштадте - Захаров 
Горный институт в СПб - Воронихин 
Казанский собор в СПб – Воронихин 
Ограда казанского собора в СПб – Воронихин 
Интерьер Казанского собора в СПб – Воронихин 
Воронихинские колоннады в Петергофе – Воронихин 
Елагиноостровский дворец в СПб - Росси  
Михайловский дворец в СПб - Росси 
Здание Сената и Синода в СПб - Росси 
Здание главного штаба в СПб – Росси 
Улица зодчего Росси в СПб – Росси 
Александринский театр в СПб – Росси 
Стрелка васильевского острова в СПб – Тома де Томон  
Биржа на стрелке Васильевского острова в СПб – Тома де Томон 
Ростральная колонна на стрелке Васильевского острова в СПб – Тома де Томон 
Исаакиевский собор в СПб – Монферран 
Александровская колонна в СПб – Монферран 
Памятник Николаю 1 в СПб – Клодт, Монферран 
Дом Лобанова-Ростовского («Дом со львами») в СПб – Монферран 
Нарвские ворота в СПб - Стасов 
Московские ворота в СПб – Стасов 
Спасо-Преображенский собор в СПб – Стасов 
Троице-Измайловский собор в СПб – Стасов 
Московский вокзал в СПб - Тон 
Храм Христа Спасителя в Москве – Тон 
Интерьер храма Христа Спасителя в Москве – Тон 
Большой кремлевский дворец в Москве – Тон 
Георгиевский зал Большого кремлевского дворца в Москве – Тон 
Троицкая церковь в Танкеевке, Татарстан - Тон 
Мариинский дворец в СПб – Штакеншнейдер 
Николаевский дворец в СПб - Штакеншнейдер 
Дворец  Белосельских-Белозерских в СПб - Штакеншнейдер 
Пулковская обсерватория в СПб – Брюллов 
Михайловский театр в СПб – Брюллов 
Лютеранская церковь Петра и Павла «Петрикирхе» в СПб – Брюллов 
Памятник-колонна Дмитрию Донскому на Куликовом поле - Брюллов 
Храм Спаса на крови в СПб – Парланд 
Ограда храма Спаса на крови в СПб – Парланд 
Интерьер храма Спаса на крови в СПб – Парланд 
Исторический музей в Москве – Шервуд 
Верхние торговые ряды в Москве (ГУМ) – Померанцев 
Здание Мосгордумы - Чичагов 
Морской собор в Кронштадте – Косяков 
Интерьер владимирского собора в Киеве - Беретти 
Князь-Владимирский собор в Херсонесе – Гримм 
Софийский собор в Лаишево - Малиновский 
Всехскорбященская церковь в Свияжске - Малиновский 
Готическая капелла в Петергофе – Шинкель 
Вокзал в Петергофе – Бенуа 
Придворные конюшни в Петергофе - Бенуа 
Торговый дом «Мюр и Мэрилиз» (ЦУМ) в Москве - Клейн 
Музей изящных искусств (Пушкинский музей) в Москве – Клейн 
Училище барона Штиглица – Месмахер 
Здание Мариинского театра – Шретер, Кавос  
Оперный театр в Одессе – Фельнер 
Церковь в усадьбе Абрамцево – Васнецов 
Главный вход в третьяковскую галерею в Москве – Васнецов 
Собственный дом Васнецова в Москве 
Собственный дом Фешина в Таосе (США) 
Терем в Талашкино – Малютин 
Церковь в Талашкино – Малютин 
Дом Перцова в Москве – Малютин 
Здание государственного банка в Нижнем Новгороде - Покровский 
Дом «Зингер» в СПб – Сюзор  
Торговый дом «Братья Елисеевы» (Елисеевский магазин)  в СПб - Барановский 
Особняк Кшесинской в СПб – фон Гоген 
Гостиница «Метрополь» в Москве – Валькотт, Кекушев 
Собственный дом Кекушева в Москве - Кекушев 
Дом Арсения Морозова в Москве – Мазырин 
Дом Зинаиды Морозовой в Москве – Шехтель 
Интерьер в доме З.Морозовой – Шехтель 
Дом Дерожинской в Москве – Шехтель 
Интерьер в доме Дерожинской – Шехтель 
Дом Рябушинского в Москве – Шехтель 
Лестница в доме Рябушинского в Москве – Шехтель 
Ярославский вокзал в Москве – Шехтель 
Типография «Утро России» в Москве – Шехтель 
Казанский вокзал в Москве - Щусев 
Собор Марфо-Мариинской обители в Москве – Щусев 
Интерьер Собор Марфо-Мариинской обители в Москве 
Храм-памятник на Куликовом поле – Щусев`.split('\n')