buildings = `Пещерный инкерманский монастырь. Севастополь
Софийский собор в Киеве («София киевская»)
Мозаики Софии Киевской
Киево-Печерская лавра
Успенский собор Киево-Печерской Лавры
«Золотые ворота» в Киеве
Пятницкая церковь в Чернигове
Новгородский кремль
Софийский собор в Новгороде Великом («София новгородская»)
Владычная грановитая палата в новгородском кремле 
Юрьев монастырь в Новгороде Великом
Георгиевский собор Юрьева монастыря
Церковь Спаса на Нередице под Новгородом
Церковь Спаса Преображения на Ильине улице в Новгороде
Фрески Феофана Грека в церкви Спаса Преображения на Ильине улице в Новгороде
Новгородская икона «Знамение»
Новгородская икона Георгия Победоносца
Псковский кремль
Спасо-Преображенский собор Мирожского монастыря в Пскове
Церковь Богоявления с Запсковья в Пскове
Церковь Василия на Горке в Пскове
Церковь Покрова и Рождества «от Пролома» в Пскове
Псково-Печерский монастырь
Спасо-Преображенский собор в Переяславле-Залесском
Храмовый комплекс в Кидекше близ Суздаля
«Золотые ворота» во Владимире
Успенский собор во Владимире
Фрески Андрея Рублева в Успенском соборе во Владимире
Иконы «Звенигородского чина» Андрея Рублева
Икона «Троица» Андрея Рублева
Икона «Владимирская»
Дмитровский собор во Владимире
Церковь Покрова на Нерли близ Владимира
Георгиевский собор в Юрьев-Польском
Спасо-Евфимьев мужской монастырь в Суздале
Покровский женский монастырь в Суздале
Суздальский кремль
Спасский собор Спасо-Андронникова монастыря в Москве
Троицкий собор Троице-Сергиевой лавры близ Москвы
Духовская церковь Троице-Сергевой лавры близ Москвы
Соборная площадь московского кремля
Успенский собор московского кремля
Благовещенский собор московского кремля
Архангельский собор московского кремля
Колокольня Ивана Великого в московском кремле
Грановитая палата московского кремля
Интерьер грановитой палаты московского кремля
Троицкая и кутафья башни московского кремля
Царская башня московского кремля
Спасская башня московского кремля
Никольская башня московского кремля
Новодевичий монастырь в Москве
Нижегородский кремль
Соловецкий монастырь
Спасо-Преображенский собор соловецкого монастыря
Церковь на Секирной горе на Соловках
Фреска Николая Чудотворца в Ферапонтова, мастер Дионисий
Архитектурный комплекс в Коломенском в Москве
Церковь Вознесения в Коломенском в Москве
Церковь Иоанна Предтечи в Дьяково близ Коломенского в Москве
Церковь Спаса-Преображения в селе Остров близ Москвы
Икона «Благословенно воинство Небесного Царя»
Покровский собор в Москве «Храм Василия Блаженного»
Теремной дворец московского кремля
Престольная (золотая) палата теремного дворца московского кремля
Палаты Аверкия Кириллова в Москве
Крутицкое подворье в Москве
Церковь Троицы в Никитниках в Москве
Церковь Рождества Богородицы в Путинках в Москве
Новоиерусалимский монастырь близ Москвы
Воскресенский собор Новоиерусалимского монастыря
Церковь Илии Пророка в Ярославле
Церковь Усекновения главы Иоанна Предтечи в Толчкове, Ярославль
Архитектурный комплекс в Коровниках, Ярославль
Ростовский кремль
Церковь Успения на Покровке в Москве
Церковь Воскресения Христова в Кадашах, Москва
Церковь Покрова в Филях, Москва
Церковь иконы «Знамение» в Дубровицах близ Москвы
Церковь Рождества Богородицы в Нижнем Новгороде («Строгановская церковь»)`.split('\n')