buildings = `Софийский собор в Константинополе, И.Милетский, 532-537
Церковь Сергия и Вакха в Константинополе, И.Милетский, 527-529
Церковь Сан Витале в Равенне, 527-548, Ит
Собор Сан-Марка в Венеции, Контарини, Доменико I, 829 Ит
Город Константинополь: план и общий вид
Купола и своды Византии. а - римский крестовый свод, б - вспарушенный свод на четырех опорах, в - вспарушенный свод на восьми опорах, г - купол на парусах, д - купол с погашением распора боковыми куполами, е - крестово-купольная система перекрытий
Ордера Византии. но­вые ти­пы ко­лон­ных опор (зер­каль­но-глад­кие и без эн­та­зи­са) и ка­пи­те­лей (пуль­ва)
Золотые ворота и стены Константинополяные
Стены Константинополя, 408-413, Анфимий
Мавзолей Теодориха в Равенне, 520, Ит
Мавзолей Галлы Плацидии в Равенне, V 2чт, Ит
Крестово-купольный тип византийских храмов
Византийские цистерны, 306-337
Церковь Санта Мария. Наранко, 842-848, Исп.
Город Каркассон, VI, Фр.
Замок Лидс. 857, Англия
Замок Сюлли. арх. Раймон дю Темпел, 1395,  Франция
Замок-арк. к. XIII Испания
Своды романской архитектуры
Собор в Пуатье. 1160-1271. Франция
Собор Сантульяно в Овьедо. 1388-1539. Р.Х.Хонтальон. Франция
Аббатство Клюни. 1088-1220. Франция
Церковь Святого Михаила в Хильдесхейме. Б. Хильдесхаймский, Годерам. 1010-1033. Германия
Собор аббатства Св. Марии в Лаахе. XIв.-1216. Германия
Собор в Пизе. Бускето ди Джовани Джудиче. 1063-1092. Италия
Баптистерий в Пизе. Диотисальви. 1152-1363. Италия
Мост Риальто в Венеции. Антонио де Понте. 1588-91. Италия
Конструктивный разрез и план романского собора
Крестовый ребристый свод готики
Конструктивный разрез, план и фасад типичного готического храма
Капелла Сент-Шапель в Париже. Франция
Горгулья
Роза
Контрфорс
Витраж
Аркбутан
Нотр-Дам де Пари (собор Парижской Богоматери). Париж
Собор в Кентерберри. Англия
Собор в Солсбери. Англия
Палаццо Дожей в Венеции. Италия
Миланский собор. Италия
Билярская соборная мечеть (план и общий вид) Х – начало ХIII вв.
Черная палата в Булгаре ХIV в.
Белая палата (баня-хаммам) в Булгаре ХIV в.
Красная палата (баня-хаммам) в Булгаре ХIV в.
Булгарская соборная мечеть (план и общий вид) ХIV в.
Северный мавзолей в Булгаре
Ханские усыпальницы с Малым минаретом в Булгаре
Ханские мавзолеи Казанского кремля  пол. ХVI в.
Вилла Джулия. Виньола , Амманати, 1550-55, Рим, Ит
Церковь Иль-Джезу в Риме, Виньола, 1568-1584, Рим, Ит
Вилла Альмерико-Вальмарана (Ротонда) близ Виченцы, Палладио, 1551-1567, Ит
Площадь Капитолия в Риме, Микеланджело, 1540-е., Ит
Базилика Санта-Кроче во Флоренции, Ф. Брунеллески, А. ди Камбио, 1294-1442, Ит
Собор Санта Мария дель Фьоре с колокольней во Флоренции, А. ди Камбио, Ф. Брунеллески, Ит
Площадь Синьории во Флоренции, менялась с 1300-х до 1500, Ит
Дворец Синьории во Флоренции. А. ди Камбио (это он на площади синьории сверху), 1299-314. Ит
Лоджия деи Ланци на площади Синьориии во Флоренции. Ф. Таленти. На той же площади. 1376-82. Ит
Дворец Дожей на площади Святого Марко в Венеции, Палладио., Б. Бон, -1424, Итворец Дожей на площади Святого Марко в Венеции
Коллегия Сан Грегорио в Вальядолиде. Хуан де Гуас. 1445-1616, Исп.
Университет в Саламанке, Исп
Биржа в Севилье, Хуан де Эррера. 1584-98. Исп.
Дворец Лувра. Пьер Леско, Жан Гужон. 1527-, Париж, Фр.
Иниго Джонс. Банкетинг-хаусЛондон
Иниго Джонс. Куин-ХаусЛондон
Кристофер Рен. Военно-морской королевский госпиталь в Гринвиче
Кристофер Рен. Собор Святого Павла в Лондоне
Площадь дель Попполо в Риме
Бернини. Площадь Святого Петра в Риме
Бернини. Церковь Сант Андреа в Риме
Бернини. Фонтан Тритона на площади Барберини
Бернини. Фонтан Четырех рек на площади Навона. Рим
Борромини. Церковь Сант Иво делла Сапиенца в Риме
Борромини. Церковь Сант Аньезе (Святой Агнессы)
Гварино Гварини. Палаццо Кариньяно в Турине
Бальдассаре Лонгена. Церковь Санта Мария делла Салюте в Венеции
Лонгена. Палаццо Пезаро в Венеции
Париж. План города
Луи Лево. Дворец-замок Во-ле-Виконт близ Мелена. Франция
Лувр. План и общий вид ансамбля
Дворцовый ансамбль Версаля (план и общий вид)
Ж. Ардуэн-Мансар. Ансамбль Дома инвалидов. Париж
Ж. Ардуэн-Мансар. Вандомская площадь в Париже
Парк Сан-Суси в Потсдаме. Германия
Георг Кнобельсдорф. Дворец в парке Сан-Суси
Пеппельман. Ансамбль Цвингер. Дрезден. Германия
Л. Хильдебрандт. Дворец Верхний Бельведер в Вене. Австрия
Габриэль. Дворец Малый Трианон. Версаль
Жан Никола Сервандони. Церковь Сен Сюльпис в Париже
Леду. Застава Ла Виллет в Париже
Суффло. Пантеон в Париже
Суффло. Церковь Сен-Мадлен в Париже
Джон Карр. Дворец Хеавуд. Англия`.split('\n')