buildings = `Софийский собор в Константинополе, И.Милетский, 532-537
Церковь Сергия и Вакха в Константинополе, И.Милетский, 527-529
Церковь Сан Витале в Равенне, 527-548, Ит
Собор Сан-Марка в Венеции, Контарини, Доменико I, 829 Ит
Город Константинополь: план и общий вид
Купола и своды Византии. а - римский крестовый свод, б - вспарушенный свод на четырех опорах, в - вспарушенный свод на восьми опорах, г - купол на парусах, д - купол с погашением распора боковыми куполами, е - крестово-купольная система перекрытий
Ордера Византии. но­вые ти­пы ко­лон­ных опор (зер­каль­но-глад­кие и без эн­та­зи­са) и ка­пи­те­лей (пуль­ва)
Золотые ворота и стены Константинополяные
Стены Константинополя, 408-413, Анфимий
Мавзолей Теодориха в Равенне, 520, Ит
Мавзолей Галлы Плацидии в Равенне, V 2чт, Ит
Крестово-купольный тип византийских храмов
Византийские цистерны, 306-337
Церковь Санта Мария. Наранко, 842-848, Исп.
Город Каркассон, VI, Фр.
Замок Лидс. 857, Англия
Замок Сюлли. арх. Раймон дю Темпел, 1395,  Франция
Замок-арк. к. XIII Испания
Своды романской архитектуры
Собор в Пуатье. 1160-1271. Франция
Собор Сантульяно в Овьедо. 1388-1539. Р.Х.Хонтальон. Франция
Аббатство Клюни. 1088-1220. Франция
Церковь Святого Михаила в Хильдесхейме. Б. Хильдесхаймский, Годерам. 1010-1033. Германия
Собор аббатства Св. Марии в Лаахе. XIв.-1216. Германия
Собор в Пизе. Бускето ди Джовани Джудиче. 1063-1092. Италия
Баптистерий в Пизе. Диотисальви. 1152-1363. Италия
Мост Риальто в Венеции. Антонио де Понте. 1588-91. Италия
Конструктивный разрез и план романского собора
Крестовый ребристый свод готики
Конструктивный разрез, план и фасад типичного готического храма
Капелла Сент-Шапель в Париже. Пьер из Монтрей. 1242-1248. Франция
Горгулья
Роза
Контрфорс
Витраж
Аркбутан
Нотр-Дам де Пари. Виолле-ле-Дюк, Жан де Шель. 1163-1345. Париж
Собор в Кентерберри. Августин Кентерберийский. 603. Англия
Собор в Солсбери. Ричард Пур. 1220-1320. Англия
Палаццо Дожей в Венеции. Палладио., Б. Бон 1309-1424. Бараттьеро. Италия
Миланский собор. С.да Орсениго 1386 Италия
Билярская соборная мечеть (план и общий вид) Х – начало ХIII вв.
Черная палата в Булгаре ХIV в.
Белая палата (баня-хаммам) в Булгаре ХIV в.
Красная палата (баня-хаммам) в Булгаре ХIV в.
Булгарская соборная мечеть (план и общий вид) ХIV в.
Северный мавзолей в Булгаре, 1330
Ханские усыпальницы с Малым минаретом в Булгаре, XIV в.
Ханские мавзолеи Казанского кремля  пол. ХVI в.
Вилла Джулия. Виньола , Амманати, 1550-55, Рим, Ит
Церковь Иль-Джезу в Риме, Виньола, 1568-1584, Рим, Ит
Вилла Альмерико-Вальмарана (Ротонда) близ Виченцы, Палладио, 1551-1567, Ит
Площадь Капитолия в Риме, Микеланджело, 1540-е., Ит
Базилика Санта-Кроче во Флоренции, Ф. Брунеллески, А. ди Камбио, 1294-1442, Ит
Собор Санта Мария дель Фьоре с колокольней во Флоренции, А. ди Камбио, Ф. Брунеллески, Ит
Площадь Синьории во Флоренции, менялась с 1300-х до 1500, Ит
Дворец Синьории во Флоренции. А. ди Камбио (это он на площади синьории сверху), 1299-314. Ит
Лоджия деи Ланци на площади Синьориии во Флоренции. Ф. Таленти. На той же площади. 1376-82. Ит
Дворец Дожей на площади Святого Марко в Венеции, Палладио., Б. Бон, 1309-1424, Ит
Коллегия Сан Грегорио в Вальядолиде. Хуан де Гуас. 1445-1616, Исп.
Университет в Саламанке, Исп
Биржа в Севилье, Хуан де Эррера. 1584-98. Исп.
Дворец Лувра. Пьер Леско, Жан Гужон. 1527-, Париж, Фр.
Банкетинг-хаус. Иниго Джонс. 1619-1722. Лондон
Куин-Хаус. Иниго Джонс. 1635. Лондон
Военно-морской королевский госпиталь в Гринвиче. Кристофер Рен. 1696-1712. Анг
Кристофер Рен. Собор Святого Павла в Лондоне. 1675-1708. Анг
Площадь дель Попполо в Риме. Джузеппе Валадье. 1811-1822. Ит
Площадь Святого Петра в Риме. Бернини. Джованни Бернини. 1656-1667. Ит
Церковь Сант Андреа в Риме. Бернини. 1658-1678. Ит
Фонтан Тритона на площади Барберини. Бернини. 1642-1643. Ит
Фонтан Четырех рек на площади Навона в Риме. Бернини. 1648-1651. Ит
Церковь Сант Иво делла Сапиенца в Риме. Борромини. 1642-1660. Ит
Церковь Сант Аньезе (Святой Агнессы). Борромини, Райнальди. 1652-1672. Ит.
Палаццо Кариньяно в Турине. Гварино Гварини. 1679. Ит
Церковь Санта Мария делла Салюте в Венеции. Бальдассаре Лонгена. 1631-1681. Ит
Палаццо Пезаро в Венеции. Лонгена. 1659-1710. Ит
Париж. План города
Дворец-замок Во-ле-Виконт близ Мелена. Луи Лево. 1651-61. Франция
Лувр. План и общий вид ансамбля
Дворцовый ансамбль Версаля (план и общий вид). Луи лево, Мансар. 1624-1631. Фр
Ансамбль Дома инвалидов. Ж. Ардуэн-Мансар. 1670-1706. Париж
Вандомская площадь в Париже. Ж. Ардуэн-Мансар. 1699. Фр
Парк Сан-Суси в Потсдаме. Георг Кнобельсдорф. 1745-47. Рококо Ге
Дворец в парке Сан-Суси. Георг Кнобельсдорф. Рококо. 1745-47 Ге
Ансамбль Цвингер Дрезден. Пеппельман. 1711-22. Рококо Германия
Дворец Верхний Бельведер в Вене. Л.Хильдебрандт. 1714-1716. Рококо Австрия
Дворец Малый Трианон. Габриэль. 1762-1768. Версаль. Фр
Церковь Сен Сюльпис в Париже. Жан Никола Сервандони. 1646. Фр
Застава Ла Виллет в Париже. Леду. 1785-89. Фр
Пантеон в Париже. Суффло. 1758. Фр
Церковь Сен-Мадлен в Париже. Суффло, Виньон. 1764-1842. Фр
Дворец Хеавуд. Джон Карр. 1771. Англия`.split('\n')