buildings = `Рубка в реж
Рубка в обло
Рубка в лапу
Потес
Струг (скобель)
Тесло
Волоковое окно
Красное окно
Охлупень
Курица
Самцы
Слеги
Причелина
Восьмерик на четверике
Крещатая бочка
Шатер
Куб
Лемех
Полица
Повал
Повалуша
Ряжевый мост
Мельница-столбовка
Мельница-шатровка
Дом Ошевнева в Кижах
Дом Елизарова в Кижах
Дворец царя Алексея Михайловича в Коломенском в Москве
Успенская церковь в Кондопоге
Интерьер трапезной в церкви в Кондопоге
Троицкая церковь в Свияжске
Церковь Воскрешения Лазаря в Кижах
Церковь из села Бородава в музее Кирилло-Белозерского монастыря
Преображенская церковь из села Спас-Вежи в Ипатьевском монастыре
Юромский погост. Рисунок Билибина
Колокольня в Цивозере. Рисунок Билибина
Андреевская церковь на Соловках
«Церковь Левитана» в г.Плёс
Никольская церковь в п.Повенец
Успенский собор в г. Кемь
Троицкая церковь в Нёноксе
Церковь рождества Иоанна Предтечи на Ширковом погосте
Покровская зимняя церковь в Кижах
Преображенская летняя церковь в Кижах
Воссозданная Покровская церковь в парке Богословка, СПб
«Погодинская изба» в Москве
Усадьба Тюрина в Пензе
Деревянный квартал "Иркутская слобода"
Терем в Чухломе, Костромская область
Дом Шорина в Гороховце
Ставкирка в Боргунне, Норвегия
Церкви в провинции Марамуреш, Румыния
Часовенный мост Капелльбрюкке в Люцерне, Швейцария
Квартал Брюгген в Бергене, Норвегия
Пагода Тяньнин в Китае
Монастырь Хорю-Дзи в Японии`.split('\n')