buildings = `Софийский собор в Константинополе
Церковь Сергия и Вакха в Константинополе
Церковь Сан Витале в Равенне
Собор Сан-Марка в Венеции
Монастырь Пантократора
Город Константинополь: план и общий вид
Типы церквей Византии
Купола и своды Византии
Ордера Византии
Золотые ворота Константинополя
Церковь Апостолов в Солуни
Церковь Пантанассы в Мистре
Мавзолеи Византии
Стены Константинополя
Дворец Буколеон в Константинополе
Дворец Теодориха в Константинополе
Мавзолей теодориха в Равенне
Мавзолей Галлы Плацидии в Равенне
Баптистерий Православных в Равенне
Базилика Сант Аполлинаре ин Классе в Равенне
Базилика Сант Апполинаре Нуово в Равенне
Церковь СвИрина в Константинополе
Церковь Апостолов в Константинополе
Крестово-купольный тип византийских храмов
Византийские цистерны
Баптистерий Сен Жан. Пуатье
Церковь Санта Мария. Наранко
Город Каркассон
Замок Лидс. Англия
Замок Сюлли. Франция
Замок Хёрбург. Германия Баден-Вюртенберг
Замок-аркИспания
Своды романской архитектуры
Собор в Пуатье. Франция
Собор Сантульяно в Овьедо. Франция
Собор Сен-Нектер в Оверне. Франция
Церковь Сен-Мадлен в Везле. Франция
Церковь Сен Сернен в Тулузе. Франция
Церковь Сент Фрон в Перигё. Франция
Аббатство Фонтевро. Франция
Аббатство Клюни. Франция
Церковь Святого Михаила в Хильдесхейме. Германия 
Собор в Шпейере. Германия 
Собор аббатства СвМарии в Лаахе. Германия 
Собор Святого Мартина в Майнце. Германия 
Церковь Сан Миньято аль Монте. Флоренция
Собор в Пизе. Италия 
Баптистерий в Пизе
Баптистерий Сан Джованни во Флоренции
Церковь СвМарии в Кембридже. Англия
Мост РиальтоВенеция. Италия 
Конструктивный разрез и план романского собора
Крестовый ребристый свод готики
Конструктивный разрез, план и фасад типичного готического храма
Капелла Сент-Шапель в Париже. Франция
Горгулья
Роза
Контрфорс
Витраж
Фиал
Готические арочные окна
Перспективный портал
Аркбутан
Пучок-колонн
Монастырь Мон-Сен-Мишель. Франция
Нотр-Дам де Пари (собор Парижской Богоматери)Париж
Амьенский собор. Франция
Руанский собор. Франция
Реймский собор. Франция
Шартрский собор. Франция
Собор в Наумбурге. Германия 
Кёльнский собор. Германия 
Собор в Эксетере. Англия
Собор в Кентерберри. Англия
Вестминстерский собор в Лондоне
Собор в СолсбериАнглия
Палаццо Дожей в Венеции. Италия 
Миланский собор. Италия 
Города Волжско-Камской Булгарии: Биляр (Великий Булгар) Булгар Джукетау Сувар Ошель Муромский городок
Типы планировок булгарских городов
Билярская соборная мечеть (план и общий вид)
Булгарские бани-хаммам (планы и реконструкции объемов)
Булгарские деревянные мавзолеи
Булгар – столица Булгарского улуса Золотой Орды (план)
Черная палата в Булгаре
Белая палата (баня-хаммам) в Булгаре
Красная палата (баня-хаммам) в Булгаре
Восточная палата (баня-хаммам) в Булгаре
Булгарская соборная мечеть (план и общий вид)
Северный мавзолей в Булгаре
Ханские усыпальницы с Малым минаретом в Булгаре
Типы жилищ Булгара золотоордынского периода
Ханская Казань (план города)
Кремль ханской Казани (план и реконструкция общего вида)
Каменные постройки кремля ханской Казани (реконструкции С.САйдарова)
Каменные постройки кремля ханской Казани (реконструкции Н.ХХалитова)
Ханские мавзолеи Казанского кремля ханского периода
Типы мечетей Казанского кремля ханского периода
Амманати и ВиньолаВилла Джулия (вилла папы Юлия III)
ВиньолаОратория Сант-Андреа на Виа Фламиниа в Риме
Виньола. Вилла Фарнезе в Капрарола близ Витербо
Виньоло. Палаццо Фарнезе в Пьяченце
Виньола. Церковь Иль-Джезу в Риме
Виньлла. Трактат «Правила пяти ордеров»
Палладио. Вилла Альмерико-Вальмарана (Ротонда) близ Виченцы
Палладио. Палаццо Кьерикати близ Виченцы
Палладио. Палаццо Вальмарана в Риме
Палладио. Вилла КапраВиченца
Палладио. Собор Сан Джордже Маджоре. Венеция
Палладио. Трактат «Четыре книги об архитектуре»
Микеланджело. Капелла Медичи церкви Сан-Лоренцо во Флоренции
Микеланджело. Площадь Капитолия в Риме
Микеланджело. Библиотека Лауренциана во Флоренции
Микеланджело. Восточный придел собора Святого Петра в Риме
Флоренция (план города)
Базилика Санта-Кроче во Флоренции
Собор Санта Мария дель Фьоре с колокольней во Флоренции
Соборная площадь во Флоренции
Баптистерий Сан-Джованни во Флоренции
Площадь Санто-Кроче во Флоренции
Площадь Аннунциаты во Флоренции
Площадь Синьориии во Флоренции
Арнольфо ди КамбиоДворец Синьории во Флоренции
Ф. Таленти. Лоджия деи Ланци на площади Синьориии во Флоренции
Венеция (план города)
Площадь Святого Марко в Венеции
Дворец Дожей на площади Святого Марко в Венеции
Идеальные города эпохи Возрождения
Хуан де Гуас. Коллегия Сан Грегорио в Вальядолиде
Университет в Саламанке
Хуан Де Толедо, Хуан де Эррера. Дворец-монастырь Эскориал
Хуан де Эррера. Биржа в Севилье
Педро Мачука. Дворец Карла V в Дворцовом комплексе Альгамбра. Гранада
Пьер Леско, Жан Гужон. Дворец Лувра
Жак Сурдо, Дени Сурдо, Пьер Невой. Замок Шамбор
Уоллатон-Холл в Ноттингемшире
Джон Торн. Ноул хауз в Кенте
Хетфилд-Холл
Хемптон-Холл
Иниго Джонс. Банкетинг-хаусЛондон
Иниго Джонс. Куин-ХаусЛондон
Кристофер Рен. Военно-морской королевский госпиталь в Гринвиче
Кристофер Рен. Собор Святого Павла в Лондоне
Рим (план города)
Площадь дель Попполо в Риме
Бернини. Площадь Святого Петра в Риме
Карло Райнальди, Карло Фонтана. Церковь Санта Мария ин Монтесанто и церковь Санта Мария деи Мираколи на площади дель Пополо в Риме
Бернини. Церковь Сант Андреа в Риме
Бернини. Королевская лестница («Скала реджа») в Ватикане. Рим
Бернини. Фонтан Тритона на площади Барберини
Бернини. Фонтан Четырех рек на площади Навона. Рим
Н. Сальви. Фонтан Треви по эскизам Бернини
Борромини. Церковь Сан Карло алле кватро фонтане в Риме
Борромини. Церковь Сант Иво делла Сапиенца в Риме
Борромини. Церковь Сант Аньезе (Святой Агнессы)
Карло Мадерно, Борромини, Бернини, Кортона. Палаццо Барберини в Риме
Гварино Гварини. Палаццо Кариньяно в Турине
Г. Гварини. Капелла Сан Синдоне (дель Сударио) собора в Турине (купол)
Гварино Гварини. Церковь Сан-Лоренцо в Турине
Бальдассаре Лонгена. Церковь Санта Мария делла Салюте в Венеции
Лонгена. Палаццо Пезаро в Венеции
Карло Фонтана. Церковь Сан-Марселло аль Корсо
Париж (план города)
Луи Лево. Дворец-замок Во-ле-Виконт близ МеленаФранция
Лувр. План и общий вид ансамбля
Луи Лево Лувр. Обстройка двора
ЖЛемерсьеЛувр. Павильон часов
ЖЛемерсьеЛувр. Северный и Западный павильоны
Лувр. Павильон Ришелье
Карл Перро. Лувр. Восточный павильон
Версаль (план города)
Дворцовый ансамбль Версаля (план и общий вид)
Ж. Ардуэн-Мансар. Ансамбль Дома инвалидовПариж
Ж. Ардуэн-Мансар. Собор ансамбля Дома инвалидовПариж
Ж. Ардуэн-Мансар. Вандомская площадь в Париже
Шатильон и дрНовая Королевская площадь (площадь Вогезов) в Париже
Парк Сан-Суси в Потсдаме. Германия 
Георг Кнобельсдорф. Дворец в парке Сан-Суси
Георг Кнобельсдорф. Новый дворец в Сан-Суси
ПеппельманАнсамбль ЦвингерДрезден. Германия 
Бальтазар Нейман. Вюрцбургский замок. Германия 
Бальтазар Нейман. Паломническая церковь в Фирценхейлигене. Германия 
Л. Хильдебрандт. Дворец Верхний Бельведер в Вене. Австрия
Вэнброу, ХоксмурДворец Бленхейм. Англия
Чурригера. Дворец маркизов Дос Агуас в Валенсии. Испания
Габриэль. Дворец Малый Трианон. Версаль
Жан Куртон. Отель Матиньон в Париже
Пьер Деламер. Отель Субиз в Париже
Габриэль. Застройка северной стороны площади Согласия (прежде площади Людовика XV) в Париже
Жан Никола Сервандони. Церковь Сен Сюльпис в Париже
Леду. Застава Ла Виллет в Париже
Суффло. Пантеон в Париже
Суффло. Церковь Сен-Мадлен в Париже
Джон Вуд старший. Застройка района Ройял-кресент в Бате. Англия
Джон Карр. Дворец Хеавуд. Англия
Роберт Адам. Дворец Остерли-парк в Лондоне
Уильям Кент. Ландшафтные парки`.split('\n')